In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

### Create the dataframe

In [35]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E',],['W','X','Y','Z'])

In [37]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

### Get the one of the column as a series

In [38]:
df['W']

A    1.606780
B    0.041460
C   -0.804652
D   -1.080471
E    0.975720
Name: W, dtype: float64

In [39]:
type(df['W'])

pandas.core.series.Series

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
df[['W','Z']]

          W         Z
A  1.606780 -1.329660
B  0.041460  0.110477
C -0.804652  0.358941
D -1.080471  0.833029
E  0.975720 -0.708954

### You can create and delete the column

In [42]:
df['new'] = df['W'] +  df['Z']
df

          W         X         Y         Z       new
A  1.606780 -1.115710 -1.385379 -1.329660  0.277120
B  0.041460 -0.411055 -0.771329  0.110477  0.151937
C -0.804652  0.253548  0.649148  0.358941 -0.445711
D -1.080471  0.902398  0.161781  0.833029 -0.247442
E  0.975720 -0.388239  0.783316 -0.708954  0.266766

In [43]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [44]:
df

          W         X         Y         Z       new
A  1.606780 -1.115710 -1.385379 -1.329660  0.277120
B  0.041460 -0.411055 -0.771329  0.110477  0.151937
C -0.804652  0.253548  0.649148  0.358941 -0.445711
D -1.080471  0.902398  0.161781  0.833029 -0.247442
E  0.975720 -0.388239  0.783316 -0.708954  0.266766

In [45]:
df.drop('new',axis=1,inplace=True)

In [46]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [47]:
df.shape

(5, 4)

In [48]:
df.drop('E',axis=0,inplace=True)

In [49]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [50]:
df.shape

(4, 4)

### Row Selection

In [51]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E',],['W','X','Y','Z'])

In [52]:
df

          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
B -1.678284  0.333973 -0.532471  2.117727
C  0.197524  2.302987  0.729024 -0.863091
D  0.305632  0.243178  0.864165 -1.560931
E -0.251897 -0.578120  0.236996  0.200780

In [53]:
df.loc['A']

W    0.586847
X   -1.621348
Y    0.677535
Z    0.026105
Name: A, dtype: float64

In [54]:
df.iloc[0]

W    0.586847
X   -1.621348
Y    0.677535
Z    0.026105
Name: A, dtype: float64

In [56]:
df.loc['B','Y']

-0.5324705255224986

In [57]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.586847  0.677535
B -1.678284 -0.532471